'''
Задача 3
Допиши код

Выделить из строки только цифры и объединить их в одну строку

'''

def extract_digits(input_string):
    digits_string = ''
    ...

# Пример использования:
input_str = 'a1b2c3d4'
print(extract_digits(input_str))
