'''
Задача 5
Допиши код

Найти все уникальные символы в строке и вернуть их в порядке появления

'''

def find_unique_characters(input_string):
    ...

# Пример использования:
input_str = 'abracadabra'
print(find_unique_characters(input_str))
