'''
Задача 7
Допиши код

Выделить из списка только четные числа и вернуть их в отсортированном порядке

'''

def filter_even_numbers(numbers):
    even_numbers = []

    ...

    even_numbers.sort() # сортировка чисел
    return even_numbers

# Пример использования:
numbers = [3, 8, 1, 6, 5, 2]
print(filter_even_numbers(numbers))
