'''
Задача 1

Напишите программу на Python, которая принимает на вход строку текста и 
шифрует каждую букву алфавита с помощью шифра Цезаря с заданным 
сдвигом. При этом символы пунктуации и пробелы должны оставаться неизменными.

Пример:

>>> Введите текст: Hello, World!
>>> Введите сдвиг: 3
>>> Зашифрованный текст: Khoor, Zruog!

Объяснение:

Буква 'H' была сдвинута на 3 позиции вправо и 
стала 'K'. Буква 'e' была сдвинута на 3 позиции 
вправо и стала 'h'. Буква 'l' была сдвинута на 3 
позиции вправо и стала 'o'. И так далее. 
Символы пунктуации и пробелы остаются неизменными.
'''


