'''
Задача 2
Допиши код

Заменить все пробелы в строке на символ '_'

'''

def replace_spaces(input_string):
    replaced_string = ''
    for char in input_string:
        ...
        
    return replaced_string

# Пример использования:
input_str = 'hello world, oh, my dear world!'
print(replace_spaces(input_str))
