'''
Задача 2
"Тайный шифр"

Условие:
Напишите программу на Python, которая принимает на вход 
строку текста и шифрует ее с помощью шифра Цезаря. 
Пользователь должен указать сдвиг, который будет 
использоваться для шифрования текста. Программа должна 
игнорировать символы пунктуации и пробелы, оставляя их неизменными.

Пример:

>>> Введите текст: Hello, World!
>>> Введите сдвиг: 5
>>> Зашифрованный текст: Mjqqt, Btwqi!

Объяснение:
Каждая буква в слове сдвинута на 5 позиций вправо по алфавиту. Буква 'H' стала 'M', 
'e' стала 'j', 'l' стала 'q', и так далее. Символы пунктуации и пробелы остаются неизменными.
'''


