'''
Задача 10
Реши задачу

Отфильтровать список целых чисел и оставить только те, которые делятся на 3 без остатка

'''

...

numbers = [1, 3, 5, 9, 12, 15, 20]
print(filter_numbers_divisible_by_three(numbers))
