'''
Задача 6
Допиши код

Удалить из списка все отрицательные числа

'''

def filter_negative_numbers(numbers):
    filtered_numbers = []
    for num in numbers:
        ...

# Пример использования:
numbers = [1, -2, 3, -4, 5, -6]
print(filter_negative_numbers(numbers))
